{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "|",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "'",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "^": 0,
      " ": 1,
      "[UNK]": 2,
      "|": 3,
      "'": 4,
      "а": 5,
      "б": 6,
      "в": 7,
      "г": 8,
      "д": 9,
      "е": 10,
      "ж": 11,
      "з": 12,
      "и": 13,
      "й": 14,
      "к": 15,
      "л": 16,
      "м": 17,
      "н": 18,
      "о": 19,
      "п": 20,
      "р": 21,
      "с": 22,
      "т": 23,
      "у": 24,
      "ф": 25,
      "х": 26,
      "ц": 27,
      "ч": 28,
      "ш": 29,
      "щ": 30,
      "ъ": 31,
      "ы": 32,
      "ь": 33,
      "э": 34,
      "ю": 35,
      "я": 36,
      "на": 37,
      "ст": 38,
      "ер": 39,
      "ка": 40,
      "ть": 41,
      "по": 42,
      "ко": 43,
      "ль": 44,
      "ре": 45,
      "но": 46,
      "ро": 47,
      "де": 48,
      "ра": 49,
      "от": 50,
      "се": 51,
      "ле": 52,
      "ва": 53,
      "ни": 54,
      "лю": 55,
      "те": 56,
      "ки": 57,
      "ри": 58,
      "ли": 59,
      "не": 60,
      "ди": 61,
      "ма": 62,
      "фи": 63,
      "во": 64,
      "то": 65,
      "за": 66,
      "ла": 67,
      "чи": 68,
      "ест": 69,
      "мо": 70,
      "ви": 71,
      "го": 72,
      "ты": 73,
      "ти": 74,
      "ся": 75,
      "ца": 76,
      "клю": 77,
      "че": 78,
      "зо": 79
    },
    "merges": [
      "н а",
      "с т",
      "е р",
      "к а",
      "т ь",
      "п о",
      "к о",
      "л ь",
      "р е",
      "н о",
      "р о",
      "д е",
      "р а",
      "о т",
      "с е",
      "л е",
      "в а",
      "н и",
      "л ю",
      "т е",
      "к и",
      "р и",
      "л и",
      "н е",
      "д и",
      "м а",
      "ф и",
      "в о",
      "т о",
      "з а",
      "л а",
      "ч и",
      "е ст",
      "м о",
      "в и",
      "г о",
      "т ы",
      "т и",
      "с я",
      "ц а",
      "к лю",
      "ч е",
      "з о"
    ]
  }
}