{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "|",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "'",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "^": 0,
      " ": 1,
      "[UNK]": 2,
      "|": 3,
      "'": 4,
      "а": 5,
      "б": 6,
      "в": 7,
      "г": 8,
      "д": 9,
      "е": 10,
      "ж": 11,
      "з": 12,
      "и": 13,
      "й": 14,
      "к": 15,
      "л": 16,
      "м": 17,
      "н": 18,
      "о": 19,
      "п": 20,
      "р": 21,
      "с": 22,
      "т": 23,
      "у": 24,
      "ф": 25,
      "х": 26,
      "ц": 27,
      "ч": 28,
      "ш": 29,
      "щ": 30,
      "ъ": 31,
      "ы": 32,
      "ь": 33,
      "э": 34,
      "ю": 35,
      "я": 36,
      "ст": 37,
      "ен": 38,
      "но": 39,
      "на": 40,
      "пр": 41,
      "то": 42,
      "по": 43,
      "ра": 44,
      "го": 45,
      "ко": 46,
      "не": 47,
      "во": 48,
      "ва": 49,
      "ет": 50,
      "ни": 51,
      "ер": 52,
      "ел": 53,
      "ит": 54,
      "ны": 55,
      "ени": 56,
      "за": 57,
      "ро": 58,
      "ли": 59,
      "ем": 60,
      "да": 61,
      "ка": 62,
      "об": 63,
      "ед": 64,
      "ла": 65,
      "от": 66,
      "ся": 67,
      "ть": 68,
      "до": 69,
      "ло": 70,
      "ль": 71,
      "со": 72,
      "ци": 73,
      "ре": 74,
      "про": 75,
      "ми": 76,
      "мо": 77,
      "та": 78,
      "это": 79,
      "ру": 80,
      "ста": 81,
      "ки": 82,
      "при": 83,
      "се": 84,
      "ти": 85,
      "вы": 86,
      "мы": 87,
      "ви": 88,
      "ес": 89,
      "бы": 90,
      "ля": 91,
      "ма": 92,
      "сти": 93,
      "ме": 94,
      "ле": 95,
      "что": 96,
      "од": 97,
      "ча": 98,
      "ения": 99,
      "ри": 100,
      "ель": 101,
      "ей": 102,
      "га": 103,
      "раз": 104,
      "ну": 105,
      "па": 106,
      "сто": 107,
      "су": 108,
      "си": 109,
      "бо": 110,
      "пред": 111,
      "его": 112,
      "ду": 113,
      "ест": 114,
      "са": 115,
      "ин": 116,
      "ить": 117,
      "под": 118,
      "из": 119,
      "же": 120,
      "му": 121,
      "пер": 122,
      "ного": 123,
      "ение": 124,
      "ных": 125,
      "ку": 126,
      "ции": 127
    },
    "merges": [
      "с т",
      "е н",
      "н о",
      "н а",
      "п р",
      "т о",
      "п о",
      "р а",
      "г о",
      "к о",
      "н е",
      "в о",
      "в а",
      "е т",
      "н и",
      "е р",
      "е л",
      "и т",
      "н ы",
      "ен и",
      "з а",
      "р о",
      "л и",
      "е м",
      "д а",
      "к а",
      "о б",
      "е д",
      "л а",
      "о т",
      "с я",
      "т ь",
      "д о",
      "л о",
      "л ь",
      "с о",
      "ц и",
      "р е",
      "пр о",
      "м и",
      "м о",
      "т а",
      "э то",
      "р у",
      "ст а",
      "к и",
      "пр и",
      "с е",
      "т и",
      "в ы",
      "м ы",
      "в и",
      "е с",
      "б ы",
      "л я",
      "м а",
      "ст и",
      "м е",
      "л е",
      "ч то",
      "о д",
      "ч а",
      "ени я",
      "р и",
      "ел ь",
      "е й",
      "г а",
      "ра з",
      "н у",
      "п а",
      "ст о",
      "с у",
      "с и",
      "б о",
      "пр ед",
      "е го",
      "д у",
      "е ст",
      "с а",
      "и н",
      "ит ь",
      "по д",
      "и з",
      "ж е",
      "м у",
      "п ер",
      "но го",
      "ени е",
      "ны х",
      "к у",
      "ци и"
    ]
  }
}