{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "|",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "'",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "^": 0,
      " ": 1,
      "[UNK]": 2,
      "|": 3,
      "'": 4,
      "A": 5,
      "B": 6,
      "C": 7,
      "D": 8,
      "E": 9,
      "F": 10,
      "G": 11,
      "H": 12,
      "I": 13,
      "J": 14,
      "K": 15,
      "L": 16,
      "M": 17,
      "N": 18,
      "O": 19,
      "P": 20,
      "Q": 21,
      "R": 22,
      "S": 23,
      "T": 24,
      "U": 25,
      "V": 26,
      "W": 27,
      "X": 28,
      "Y": 29,
      "Z": 30,
      "TH": 31,
      "THE": 32,
      "IN": 33,
      "AN": 34,
      "ER": 35,
      "RE": 36,
      "ON": 37,
      "OU": 38,
      "EN": 39,
      "ED": 40,
      "AT": 41,
      "AND": 42,
      "TO": 43,
      "IS": 44,
      "AS": 45,
      "OF": 46,
      "OR": 47,
      "ING": 48,
      "AR": 49,
      "IT": 50,
      "ES": 51,
      "HE": 52,
      "AL": 53,
      "LE": 54,
      "ST": 55,
      "SE": 56,
      "AD": 57,
      "WH": 58,
      "CH": 59
    },
    "merges": [
      "T H",
      "TH E",
      "I N",
      "A N",
      "E R",
      "R E",
      "O N",
      "O U",
      "E N",
      "E D",
      "A T",
      "AN D",
      "T O",
      "I S",
      "A S",
      "O F",
      "O R",
      "IN G",
      "A R",
      "I T",
      "E S",
      "H E",
      "A L",
      "L E",
      "S T",
      "S E",
      "A D",
      "W H",
      "C H"
    ]
  }
}